Revit 2024 API
ParameterTypeId.SteelElemHoleDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemHoleDiameter { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemHoleDiameter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemHoleDiameter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace